{
  "testimonials": [
    {
      "name": "Jessica Martinez",
      "initials": "JM",
      "reviewCount": "2 reviews",
      "location": "California, US",
      "rating": 5,
      "timeAgo": "2 days ago",
      "title": "Meta Ads ROAS improved from 2.1x to 3.8x...",
      "text": "Fast Line Agency transformed our Meta Ads campaigns completely. They rebuilt our account structure, set up proper tracking, and implemented a testing framework that actually works. Our ROAS improved from 2.1x to 3.8x in just 90 days. The weekly reports are clear and actionable - finally, an agency that speaks our language!",
      "date": "December 19, 2024"
    },
    {
      "name": "David Chen",
      "initials": "DC",
      "reviewCount": "1 review",
      "location": "New York, US",
      "rating": 5,
      "timeAgo": "A day ago",
      "title": "Shopify store conversion rate increased by 32%...",
      "text": "We needed a complete Shopify redesign and Fast Line delivered beyond expectations. They created a custom theme that perfectly reflects our brand, optimized our product pages, and improved our site speed significantly. Our conversion rate increased by 32% and the store is now so much easier to manage. Highly recommend their Shopify development services!",
      "date": "December 20, 2024"
    },
    {
      "name": "Amanda Thompson",
      "initials": "AT",
      "reviewCount": "1 review",
      "location": "Texas, US",
      "rating": 5,
      "timeAgo": "3 days ago",
      "title": "TikTok Ads scaled from $5K to $25K monthly...",
      "text": "Fast Line's TikTok Ads management is outstanding. They understand the platform's unique algorithm and created campaigns that actually convert. We went from testing with $5K/month to scaling profitably at $25K/month with a 4.5x ROAS. Their creative testing approach and audience targeting strategies are top-notch. Best investment we've made!",
      "date": "December 16, 2024"
    },
    {
      "name": "Michael Rodriguez",
      "initials": "MR",
      "reviewCount": "3 reviews",
      "location": "Florida, US",
      "rating": 5,
      "timeAgo": "5 days ago",
      "title": "Social media followers grew from 10K to 55K...",
      "text": "We've been working with Fast Line for social media management for 6 months and the results speak for themselves. Our followers grew from 10K to 55K across Instagram and TikTok, engagement rates doubled, and our brand voice is now consistent across all platforms. The content calendar and community management are excellent. They truly understand our brand!",
      "date": "December 15, 2024"
    },
    {
      "name": "Sarah Kim",
      "initials": "SK",
      "reviewCount": "1 review",
      "location": "Oregon, US",
      "rating": 5,
      "timeAgo": "A week ago",
      "title": "Etsy shop made $8K in the first month...",
      "text": "Fast Line set up our Etsy shop from scratch and the results exceeded our expectations. They optimized all our product listings with proper SEO, created professional branding, and set up our shop policies perfectly. We made $8K in sales in the first month! The search visibility improvements they made were incredible. Couldn't have launched without them.",
      "date": "December 12, 2024"
    },
    {
      "name": "Robert Williams",
      "initials": "RW",
      "reviewCount": "2 reviews",
      "location": "Illinois, US",
      "rating": 5,
      "timeAgo": "2 weeks ago",
      "title": "Complete ecommerce solution - Meta Ads + Shopify...",
      "text": "Fast Line handled both our Meta Ads management and Shopify store optimization. The integration between our ad campaigns and store experience is seamless. They've managed over $500K in ad spend for us with consistent 3.5x+ ROAS, and our Shopify store conversion rate improved by 25%. Having one agency handle everything makes our life so much easier. Professional team!",
      "date": "December 5, 2024"
    },
    {
      "name": "Emily Chen",
      "initials": "EC",
      "reviewCount": "1 review",
      "location": "Washington, US",
      "rating": 5,
      "timeAgo": "3 weeks ago",
      "title": "Meta Ads creative testing framework is game-changing...",
      "text": "What impressed me most about Fast Line's Meta Ads management is their systematic approach to creative testing. They test different hooks, angles, and formats continuously, which keeps our campaigns fresh and performing. Our cost per acquisition dropped by 40% and we're scaling profitably. The transparent reporting shows exactly what's working and why.",
      "date": "November 28, 2024"
    },
    {
      "name": "James Anderson",
      "initials": "JA",
      "reviewCount": "1 review",
      "location": "Colorado, US",
      "rating": 5,
      "timeAgo": "1 month ago",
      "title": "Shopify store performance optimization exceeded expectations...",
      "text": "Fast Line optimized our existing Shopify store and the improvements were immediate. They fixed our slow load times, improved navigation, and optimized our product pages. The conversion rate lift of 25% they promised? We actually got 28%! Plus, they set up all our payment and shipping integrations perfectly. The store runs smoothly now.",
      "date": "November 26, 2024"
    }
  ]
}
